In [1]:
import numpy as np
import pandas as pd
import matplotlib
import matplotlib.pyplot as plt
import csv
from pathlib import Path

import seaborn as sns
sns.set_context("talk")
%matplotlib inline

from sklearn.model_selection import train_test_split
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.linear_model import Ridge
from sklearn.linear_model import Lasso
from sklearn.metrics import mean_squared_error
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import KFold

import warnings
warnings.filterwarnings('ignore')

In [2]:
!pip install -U -q PyDrive
from pydrive.auth import GoogleAuth
from pydrive.drive import GoogleDrive
from google.colab import auth
from oauth2client.client import GoogleCredentials

auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [3]:
!pip install -q xlrd

#1 Jobs

---

In [4]:
file_id2012 = '1xRxZCcGD8ViCNJumDdX4w7C-g71yqG17'
downloaded_2012 = drive.CreateFile({'id': file_id2012})

file_id2013 = '1A47r6yhGAxYvHguO9an0GVb-veZcVlOv'
downloaded_2013 = drive.CreateFile({'id': file_id2013})

file_id2014 = '1u3MbxrASOzzAHvdqDWj6YsHgxjJo3N-1'
downloaded_2014 = drive.CreateFile({'id': file_id2014})

file_id2015 = '1FmhBGVr6sM_CC0zeED6yg2YBv6O-rAlm'
downloaded_2015 = drive.CreateFile({'id': file_id2015})

file_id2016 = '1jlvMppVC48WdyAn2yE1GL6lXSPiI_oBh'
downloaded_2016 = drive.CreateFile({'id': file_id2016})

file_id2017 = '1iGfiFxNj6iVq_3QObA7w2EXiERvAM4BN'
downloaded_2017 = drive.CreateFile({'id': file_id2017})

file_id2018 = '15yW7Go26MSkoKkhIRgiT85KMas9POgWB'
downloaded_2018 = drive.CreateFile({'id': file_id2018})

file_id2019 = '1HFPHPNXtS5_NsrGgvPPMwkttKNw_rOeQ'
downloaded_2019 = drive.CreateFile({'id': file_id2019})

file_id2020 = '1TrADW1hJcsjrtUCJRIhQVNPlcctiQrbK'
downloaded_2020 = drive.CreateFile({'id': file_id2020})

In [5]:
# Download the file to a local disk as '2012.xlsx'.
downloaded_2012.GetContentFile('2012.xlsx')
downloaded_2013.GetContentFile('2013.xlsx')
downloaded_2014.GetContentFile('2014.xlsx')
downloaded_2015.GetContentFile('2015.xlsx')
downloaded_2015.GetContentFile('2015.xlsx')
downloaded_2016.GetContentFile('2016.xlsx')
downloaded_2017.GetContentFile('2017.xlsx')
downloaded_2018.GetContentFile('2018.xlsx')
downloaded_2019.GetContentFile('2019.xlsx')
downloaded_2020.GetContentFile('2020.xlsx')

In [6]:
df2012 = pd.read_excel('2012.xlsx')
df2013 = pd.read_excel('2013.xlsx')
df2014 = pd.read_excel('2014.xlsx')
df2015 = pd.read_excel('2015.xlsx')
df2016 = pd.read_excel('2016.xlsx')
df2017 = pd.read_excel('2017.xlsx')
df2018 = pd.read_excel('2018.xlsx')
df2019 = pd.read_excel('2019.xlsx')
df2020 = pd.read_excel('2020.xlsx')

In [7]:
df2012.head(2)

   area area_title  naics         naics_title  ...  a_pct90 annual hourly  year
0     1    Alabama     21  Sector 21 - Mining  ...    88610                2012
1     1    Alabama     21  Sector 21 - Mining  ...        #                2012

[2 rows x 27 columns]

In [8]:
df2013.head(2)

   area area_title  naics         naics_title  ...  a_pct90 annual hourly  year
0     1    Alabama     21  Sector 21 - Mining  ...    92060                2013
1     1    Alabama     21  Sector 21 - Mining  ...        #                2013

[2 rows x 27 columns]

In [9]:
df2014.head(2)

   area area_title  naics  ... annual hourly  year
0     1    Alabama     21  ...    NaN    NaN  2014
1     1    Alabama     21  ...    NaN    NaN  2014

[2 rows x 27 columns]

In [10]:
df2015.head(2)

   area area_title  naics  ... annual hourly  year
0     1    Alabama     21  ...    NaN    NaN  2015
1     1    Alabama     21  ...    NaN    NaN  2015

[2 rows x 27 columns]

In [11]:

df2016.head(2)

   area area_title  naics  ... annual hourly  year
0     1    Alabama     21  ...    NaN    NaN  2016
1     1    Alabama     21  ...    NaN    NaN  2016

[2 rows x 27 columns]

In [12]:
df2017.head(2)

   area area_title  naics  ... annual hourly  year
0     1    Alabama     21  ...    NaN    NaN  2017
1     1    Alabama     21  ...    NaN    NaN  2017

[2 rows x 27 columns]

In [13]:

df2018.head(2)

   area area_title  naics  ... annual hourly  year
0     1    Alabama     21  ...    NaN    NaN  2018
1     1    Alabama     21  ...    NaN    NaN  2018

[2 rows x 27 columns]

In [14]:
df2019.head(2)

   area area_title  naics  ... annual hourly  year
0     1    Alabama     21  ...    NaN    NaN  2019
1     1    Alabama     21  ...    NaN    NaN  2019

[2 rows x 27 columns]

In [15]:
df2020.head(2)

   AREA AREA_TITLE  NAICS  ... ANNUAL HOURLY  year
0     1    Alabama     21  ...    NaN    NaN  2020
1     1    Alabama     21  ...    NaN    NaN  2020

[2 rows x 27 columns]

"PREDICTION YEAR" is the year where our "y" variable was observed (numbers of jobs)

In [16]:
# ordering the columms so they all match(even though some of it, like 2012, 2013 and 2020 have different columns name). The important part here is to have in the same columns the same values for each year. 
df_2012 = df2012[['area',	'area_title',	'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'group',	'own_code',	 'year']]
df_2013 = df2013[['area',	'area_title', 'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'group',	'own_code',	 'year']]
df_2014 = df2014[['area',	'area_title',	'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'group', 'i_group',	 'year']]                    
df_2015 = df2015[['area',	'area_title',	'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'group', 'i_group',	 'year']] 
df_2016 = df2016[['area',	'area_title',	'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'group', 'i_group',	 'year']]
df_2017 = df2017[['area',	'area_title', 'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'group', 'i_group',	 'year']]
df_2018 = df2018[['area',	'area_title',	'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'o_group', 'i_group',	 'year']]
df_2019 = df2019[['area',	'area_title', 'tot_emp', 'naics',	'naics_title',	'occ code',	'occ title',	'o_group', 'i_group',	 'year']]
df_2020 = df2020[['AREA','AREA_TITLE',	'TOT_EMP', 'NAICS',	'NAICS_TITLE', 'OCC_CODE',	'OCC_TITLE',	'O_GROUP','I_GROUP',	 'year']]

In [17]:
# changing columns name (we don't care about occ code, own code, occ title, group, o_group, i_group) the colums that we are going to use are: STATE, INDUSTRY, OCCUPATION, TOT_EMP and YEAR.
df_2012.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2013.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2014.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2015.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2016.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2017.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2018.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2019.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']
df_2020.columns = ['AREA','STATE', 'TOT_EMP',	'NAICS',	'INDUSTRY', 'OCC_CODE',	'OCCUPATION',	'O_GROUP','I_GROUP',	'PREDICTION YEAR']

In [18]:

df_total = pd.concat([df_2012, df_2013, df_2014, df_2015, df_2016, df_2017, df_2018, df_2019, df_2020])

In [19]:
df_total.head(100)

    AREA    STATE TOT_EMP  ...  O_GROUP I_GROUP PREDICTION YEAR
0      1  Alabama    8520  ...    total       5            2012
1      1  Alabama     430  ...    major       5            2012
2      1  Alabama     180  ...      NaN       5            2012
3      1  Alabama      40  ...      NaN       5            2012
4      1  Alabama      30  ...      NaN       5            2012
..   ...      ...     ...  ...      ...     ...             ...
95     2   Alaska      30  ...    major       5            2012
96     2   Alaska      40  ...    major       5            2012
97     2   Alaska      30  ...      NaN       5            2012
98     2   Alaska      50  ...    major       5            2012
99     2   Alaska    1030  ...    major       5            2012

[100 rows x 10 columns]

In [20]:
df_total.fillna(0, inplace=True)

In [21]:
df_total['STATE'].unique()

array(['Alabama', 'Alaska', 'Arizona', 'Arkansas', 'California',
       'Colorado', 'Connecticut', 'Florida', 'Georgia', 'Hawaii', 'Idaho',
       'Illinois', 'Indiana', 'Iowa', 'Kansas', 'Kentucky', 'Louisiana',
       'Maine', 'Maryland', 'Massachusetts', 'Michigan', 'Minnesota',
       'Mississippi', 'Missouri', 'Montana', 'Nebraska', 'Nevada',
       'New Hampshire', 'New Jersey', 'New Mexico', 'New York',
       'North Carolina', 'North Dakota', 'Ohio', 'Oklahoma', 'Oregon',
       'Pennsylvania', 'Rhode Island', 'South Carolina', 'South Dakota',
       'Tennessee', 'Texas', 'Utah', 'Vermont', 'Virginia', 'Washington',
       'West Virginia', 'Wisconsin', 'Wyoming', 'Puerto Rico', 'Delaware',
       'District of Columbia', 'Virgin Islands', 'Guam'], dtype=object)

In [22]:
df_total['INDUSTRY'].unique()

array(['Sector 21 - Mining', 'Oil and Gas Extraction',
       'Mining (except Oil and Gas)', 'Coal Mining', 'Metal Ore Mining',
       'Nonmetallic Mineral Mining and Quarrying',
       'Support Activities for Mining', 'Sector 22 - Utilities',
       'Utilities',
       'Electric Power Generation, Transmission and Distribution',
       'Natural Gas Distribution', 'Water, Sewage and Other Systems',
       'Sector 23 - Construction', 'Construction of Buildings',
       'Residential Building Construction',
       'Nonresidential Building Construction',
       'Heavy and Civil Engineering Construction',
       'Utility System Construction',
       'Power and Communication Line and Related Structures Construction',
       'Land Subdivision', 'Highway, Street, and Bridge Construction',
       'Other Heavy and Civil Engineering Construction',
       'Specialty Trade Contractors',
       'Foundation, Structure, and Building Exterior Contractors',
       'Poured Concrete Foundation and Structure Contractors',
       'Masonry Contractors', 'Roofing Contractors',
       'Building Equipment Contractors',
       'Electrical Contractors and Other Wiring Installation Contractors',
       'Plumbing, Heating, and Air-Conditioning Contractors',
       'Other Building Equipment Contractors',
       'Building Finishing Contractors',
       'Drywall and Insulation Contractors',
       'Painting and Wall Covering Contractors',
       'Other Specialty Trade Contractors',
       'Sector 21 - Mining, Quarrying, and Oil and Gas Extraction',
       'Electric Power Transmission, Control, and Distribution',
       'Mining, Quarrying, and Oil and Gas Extraction',
       'Hydroelectric Power Generation',
       'Fossil Fuel Electric Power Generation',
       'Nuclear Electric Power Generation',
       'Solar Electric Power Generation',
       'Wind Electric Power Generation',
       'Geothermal Electric Power Generation',
       'Biomass Electric Power Generation',
       'Other Electric Power Generation', 'Construction',
       'Electric Power Generation'], dtype=object)

Fitering 'INDUSTRY'

In [23]:
df_solar_jobs = df_total.loc[(df_total['INDUSTRY']== 'Sector 22 - Utilities') | 
                       (df_total['INDUSTRY']== 'Utilities') |
                       (df_total['INDUSTRY']== 'Electric Power Generation, Transmission and Distribution') |
                       (df_total['INDUSTRY']== 'Utility System Construction') |
                       (df_total['INDUSTRY']== 'Electric Power Transmission, Control, and Distribution') |
                       (df_total['INDUSTRY']== 'Solar Electric Power Generation') |
                       (df_total['INDUSTRY']== 'Construction') |
                       (df_total['INDUSTRY']== 'Heavy and Civil Engineering Construction')|
                       (df_total['INDUSTRY']== 'Power and Communication Line and Related Structures Construction')|
                       (df_total['INDUSTRY']== 'Specialty Trade Contractors')|
                       (df_total['INDUSTRY']== 'Building Equipment Contractors')|
                       (df_total['INDUSTRY']== 'Electrical Contractors and Other Wiring Installation Contractors')|
                       (df_total['INDUSTRY']== 'Plumbing, Heating, and Air-Conditioning Contractors')]

In [25]:
df_CA_jobs = df_solar_jobs.loc[(df_solar_jobs['STATE']== 'California') & (df_solar_jobs['INDUSTRY'] =='Solar Electric Power Generation')]
df_CA_jobs

       AREA       STATE TOT_EMP  ...   O_GROUP  I_GROUP PREDICTION YEAR
20004     6  California     900  ...     total  6-digit            2015
20005     6  California     190  ...     major  6-digit            2015
20006     6  California      50  ...         0  6-digit            2015
20007     6  California     120  ...     major  6-digit            2015
20008     6  California      40  ...         0  6-digit            2015
...     ...         ...     ...  ...       ...      ...             ...
24000     6  California      90  ...     major  6-digit            2020
24001     6  California      90  ...  detailed  6-digit            2020
24002     6  California      50  ...     major  6-digit            2020
24003     6  California      50  ...  detailed  6-digit            2020
24004     6  California      50  ...     major  6-digit            2020

[66 rows x 10 columns]

In [26]:
df_coal_jobs = df_total.loc[ (df_total['INDUSTRY']== 'Coal Mining') ]

In [27]:
df_coal_jobs.head(3)

      AREA    STATE TOT_EMP  ...  O_GROUP I_GROUP PREDICTION YEAR
5566     1  Alabama    4820  ...    total       5            2012
5567     1  Alabama     200  ...    major       5            2012
5568     1  Alabama      70  ...        0       5            2012

[3 rows x 10 columns]

Exporting Data

In [28]:
# Exporting Solar
from google.colab import drive
drive.mount('drive', force_remount=True)

df_solar_jobs.to_excel('/content/drive/My Drive/df_colar_jobs.xlsx', encoding='utf-8', index=False)

Mounted at drive

In [30]:
# Exporting coal
from google.colab import drive
drive.mount('drive', force_remount=True)

df_coal_jobs.to_excel('/content/drive/My Drive/df_coal_jobs.xlsx', encoding='utf-8', index=False)

Mounted at drive

# 2 Nameplate capacity

In [32]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [33]:
# importing nameplate capacity for coal
file_id_nameplate = '1BIUjgoSgL3xm3or1XO2FuZs5oowvQEiR'
nameplatecoal= drive.CreateFile({'id': file_id_nameplate})
nameplatecoal.GetContentFile('nameplatecoal.xlsx')
coal_nameplate = pd.read_excel('nameplatecoal.xlsx')

In [34]:
# Coal filling with 0 all  NA/NaN values
coal_nameplate.fillna(0, inplace=True)
coal_nameplate.head(3)

   YEAR STATE  COAL NAMEPLATE CAPACITY  PREDICTION YEAR
0  2012    AK                    232.0             2013
1  2012    AL                  25195.4             2013
2  2012    AR                  10974.0             2013

In [35]:
coal_nameplate['STATE'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [36]:
#importing nameplate capacity for solar
file_id_nameplate = '1fzIkuRTQQL6gnm2GoCjwSTiT5mRHWCuW'
nameplatesolar= drive.CreateFile({'id': file_id_nameplate})
nameplatesolar.GetContentFile('nameplatesolar.xlsx')
solar_nameplate = pd.read_excel('nameplatesolar.xlsx')

In [37]:
#Solar filling with 0 all  NA/NaN values
solar_nameplate.fillna(0, inplace=True)
solar_nameplate.head(3)

   YEAR STATE  SOLAR NAMEPLATE CAPACITY  PREDICTION YEAR
0  2012    AZ                    1297.6             2013
1  2012    CA                    2371.2             2013
2  2012    CO                     233.6             2013

In [38]:
solar_nameplate['STATE'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

Demographic

In [41]:
file_id_demo = '1eiSVK53ro25GrN7Gx7iA4_Q9iSR4hsWD'
demo= drive.CreateFile({'id': file_id_demo})
demo.GetContentFile('demo.xlsx')
demographics = pd.read_excel('demo.xlsx')

Importing jobs

In [63]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [64]:
#coal (df_coal_jobs)
file_id_coal = '1-9IXYXdbloiAQq6t4uu8uRjpYusoDECl'
coaljob= drive.CreateFile({'id': file_id_coal})
coaljob.GetContentFile('coaljob.xlsx')
coal_jobs = pd.read_excel('coaljob.xlsx')

In [65]:
coal_jobs.head()

     STATE  PREDICTION YEAR  TOTAL EMPLOYMENT
0  Alabama             2012              4820
1  Alabama             2013              4680
2  Alabama             2014              4010
3  Alabama             2015              3690
4  Alabama             2017              2440

In [47]:
#Solar
file_id_solar = '1xbqkwpAA3ckZjc0ij3qWHE4zmXz2Dmaf'
solarjob= drive.CreateFile({'id': file_id_solar})
solarjob.GetContentFile('solarjob.xlsx')
solar_jobs = pd.read_excel('solarjob.xlsx')

In [48]:
solar_jobs['STATE'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [50]:
solar_jobs.head()

        STATE     JOBS  PREDICTION YEAR
0     Alabama    210.0             2012
1      Alaska     80.0             2012
2     Arizona   9800.0             2012
3    Arkansas    130.0             2012
4  California  43700.0             2012

# 3 Merging jobs and nameplate capacity

Aggregating jobs and nameplate capacity data per each techonology (coal, solar)

In [51]:
#coal
coal_jobs_nameplate= pd.merge(coal_jobs, coal_nameplate, how="outer", on=["STATE", "PREDICTION YEAR"])
# filling with 0 all  NA/NaN values
coal_jobs_nameplate.fillna(0, inplace=True)

In [52]:
# Exporting coal_jobs_nameplate (just so see how the DF is looking)
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate.to_excel('/content/drive/My Drive/coal_jobs_nameplate.xlsx', encoding='utf-8', index=False)

Mounted at drive

In [53]:
#solar
solar_jobs_nameplate= pd.merge(solar_jobs, solar_nameplate, how="outer", on=["STATE", "PREDICTION YEAR"])
# filling with 0 all  NA/NaN values
solar_jobs_nameplate.fillna(0, inplace=True)

In [54]:
# Exporting solar_jobs_nameplate (just so see how the DF is looking)
from google.colab import drive
drive.mount('drive', force_remount=True)

solar_jobs_nameplate.to_excel('/content/drive/My Drive/solar_jobs_nameplate.xlsx', encoding='utf-8', index=False)

Mounted at drive

# 4 Merging jobs, nameplate capacity and demographic

Aggregating demographic capacity data per each techonology (coal, solar)

In [57]:
#coal
coal_jobs_nameplate_demo= pd.merge(coal_jobs_nameplate, demographics, how="outer", on=["STATE", "PREDICTION YEAR"])
# filling with 0 all  NA/NaN values
coal_jobs_nameplate_demo.fillna(0, inplace=True)

In [58]:
# Exporting coal_jobs_nameplate_demo
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate_demo.to_excel('/content/drive/My Drive/coal_jobs_nameplate_demo.xlsx', encoding='utf-8', index=False)

Mounted at drive

In [59]:
#solar
solar_jobs_nameplate_demo= pd.merge(solar_jobs_nameplate, demographics, how="outer", on=["STATE", "PREDICTION YEAR"])
# filling with 0 all  NA/NaN values
solar_jobs_nameplate_demo.fillna(0, inplace=True)

In [60]:
# Exporting solar_jobs_nameplate_demo
from google.colab import drive
drive.mount('drive', force_remount=True)

solar_jobs_nameplate_demo.to_excel('/content/drive/My Drive/solar_jobs_nameplate_demo.xlsx', encoding='utf-8', index=False)

Mounted at drive

#5 Coal retirements and additions

In [66]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [67]:
#Importing the big coal dataframe (coal_jobs_nameplate_demo)
file_id = '1-okMUdobKXMbfWcwHb3J68aH_J0hy2sg'
coal_all= drive.CreateFile({'id': file_id})
coal_all.GetContentFile('coal_all.xlsx')
coal_jobs_nameplate_demo = pd.read_excel('coal_all.xlsx')

coal_jobs_nameplate_demo.head(2)

     STATE  ...  EDUCATIONAL ATTAINMENT 25 YEARS OR OLDER (BACHELOR DEGREE)
0  Alabama  ...                                                  0
1  Alabama  ...                                             472037

[2 rows x 12 columns]

##5.1 Coal historic retirements

Importing the Coal Retirements Historic (colummn N) and Projected (N+1, N+2, N+3...N+7)

In [ ]:

print(pd.get_dummies(data))
data = pd.DataFrame({'STATE':['Arizona','California','Colorado','Delaware', 'Florida', 'Georgia', 'Hawaii', 
        'Illinois', 'Indiana', 'Massachusetts', 'Maryland',
       'North Carolina', 'New Jersey', 'New Mexico', 'Nevada', 'New York', 'Ohio',
        'Oregon' , 'Pennsylvania', 'Tennessee', 'Texas',
       'Utah', 'Vermont', 'Washington',  'Connecticut', 'Minnesota',
        'Rhode Island', 'South Carolina', 'Missouri', 'Wisconsin', 'Arkansas', 'Kansas',
       'Michigan', 'Oklahoma', 'Alabama', 'Iowa', 'Idaho', 'Kentucky', 'Mississippi',
        'Nebraska', 'South Dakota', 'North Dakota', 'Alaska', 'West Virginia',
        'Virginia', 'Louisiana','Maine', 'Montana', 'Wyoming', 'District of Columbia', 'New Hampshire']})

dummies = pd.get_dummies(data)
print(dumies)

In [ ]:
# Historic retirements coal for colummn N
file_id_ret = '1MxZCMRNGvafILlw3ZszcjMC5lH8FH3K9'
coalhistoric_ret= drive.CreateFile({'id': file_id_ret})
coalhistoric_ret.GetContentFile('coalhistoric_ret.xlsx')
coal_historic_retirements = pd.read_excel('coalhistoric_ret.xlsx')

# replacen acronyms by state names
coal_historic_retirements['STATE'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [ ]:
coal_historic_retirements.head()

   YEAR        STATE  ...  PREDIC N+6  PREDIC N+7
0  2012      Arizona  ...        2019        2020
1  2012   California  ...        2019        2020
2  2012     Colorado  ...        2019        2020
3  2012  Connecticut  ...        2019        2020
4  2012      Georgia  ...        2019        2020

[5 rows x 11 columns]

In [ ]:
#Creating the list of values for retirements in year N

coal_ret = []
for index, row in coal_jobs_nameplate_demo.iterrows():

  found_match = False
  for index2, row2 in coal_historic_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['STATE']):
          found_match = True
          coal_ret.append(row2["NAMEPLATE CAPACITY RETIREMENTS (MW)"])

  if not found_match:
     coal_ret.append(0)

In [ ]:
#Adding a new colummn "HISTORIC RETIREMENTS N" with the list above to the big coal DF

coal_jobs_nameplate_demo['HISTORIC RETIREMENTS N'] = coal_ret

In [ ]:
# Exporting coal_jobs_nameplate_demo (N)
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate_demo.to_excel('/content/drive/My Drive/coal_jobs_nameplate_demo_N.xlsx', encoding='utf-8', index=False)

Mounted at drive

##5.2 Coal projected retirements

In [ ]:
file_id_coal = '1Grs1BHo_FV8cLzrs_K-LPbKsW7QaZ7RT'
retirements= drive.CreateFile({'id': file_id_coal})
retirements.GetContentFile('retirements.xlsx')
coal_projected_retirements = pd.read_excel('retirements.xlsx')

# replacen acronyms by state names
coal_projected_retirements['State'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)


coal_projected_retirements.head(2)

   PREDICTION YEAR  Year of Projection  ...       State Nameplate Capacity (MW)
0             2015                2014  ...  California                   101.2
1             2015                2014  ...    Colorado                   152.0

[2 rows x 5 columns]

In [ ]:
coal_projected_retirements.loc[coal_projected_retirements['State'] == 'Iowa']

     PREDICTION YEAR  Year of Projection  ...  State Nameplate Capacity (MW)
4               2015                2014  ...   Iowa                   536.2
49              2016                2015  ...   Iowa                   418.0
176             2020                2019  ...   Iowa                   197.7
193             2020                2019  ...   Iowa                    30.0
199             2021                2020  ...   Iowa                    28.7
205             2021                2020  ...   Iowa                   205.3
240             2022                2021  ...   Iowa                   241.4

[7 rows x 5 columns]

In [ ]:
#Colummn Retiements N+1

coal_ret_1 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():
    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR'] == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_1.append(row2["Nameplate Capacity (MW)"]))
   

  if found_match == False:
    coal_ret_1.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+1" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+1'] = coal_ret_1

In [ ]:
# Exporting coal_jobs_nameplate_demo (N+1)
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate_demo.to_excel('/content/drive/My Drive/coal_jobs_nameplate_demo_N+1.xlsx', encoding='utf-8', index=False)

Mounted at drive

In [ ]:
#Colummn Retiements N+2

coal_ret_2 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+1 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_2.append(row2["Nameplate Capacity (MW)"]))
          #continue
          

  if found_match == False:
    coal_ret_2.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+2" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+2'] = coal_ret_2

In [ ]:
# Exporting coal_jobs_nameplate_demo (N+2)
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate_demo.to_excel('/content/drive/My Drive/coal_jobs_nameplate_demo_N+2.xlsx', encoding='utf-8', index=False)

Mounted at drive

In [ ]:
#Colummn Retiements N+3

coal_ret_3 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+2 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_3.append(row2["Nameplate Capacity (MW)"]))
          #continue
          

  if found_match == False:
    coal_ret_3.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+3" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+3'] = coal_ret_3

In [ ]:
#Colummn Retiements N+4

coal_ret_4 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+3 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_4.append(row2["Nameplate Capacity (MW)"]))
          #continue
          

  if found_match == False:
    coal_ret_4.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+4" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+4'] = coal_ret_4

In [ ]:
#Colummn Retiements N+5

coal_ret_5 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+4 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_5.append(row2["Nameplate Capacity (MW)"]))
          #continue
          

  if found_match == False:
    coal_ret_5.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+5" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+5'] = coal_ret_5

In [ ]:
#Colummn Retiements N+6

coal_ret_6 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+5 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_6.append(row2["Nameplate Capacity (MW)"]))
          #continue
          

  if found_match == False:
    coal_ret_6.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+6" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+6'] = coal_ret_6

In [ ]:
#Colummn Retiements N+7

coal_ret_7 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_retirements.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+6 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_ret_7.append(row2["Nameplate Capacity (MW)"]))
          #continue
          

  if found_match == False:
    coal_ret_7.append(0)

In [ ]:
#Adding a new colummn "PROJECTED RET N+7" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED RET N+7'] = coal_ret_7

In [ ]:
# Exporting coal_jobs_nameplate_demo (N, N+1, N+2, ...., N+7)
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate_demo.to_excel('/content/drive/My Drive/coal_jobs_nameplate_demo_N+7.xlsx', encoding='utf-8', index=False)

Mounted at drive

##5.3 Coal historic additions

In [68]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [69]:
# Historic additions coal for colummn N
file_id_add = '1bA189yivbLP-zV-KN4sFQ29qN21Jweqw'
coalhistoric_add= drive.CreateFile({'id': file_id_add})
coalhistoric_add.GetContentFile('coalhistoric_add.xlsx')
coal_historic_additions = pd.read_excel('coalhistoric_add.xlsx')

# replacen acronyms by state names
coal_historic_additions['STATE'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [73]:
coal_historic_additions.head()

   YEAR           STATE  ...  PREDC N+6  PREDC N+7
0  2012        Arkansas  ...       2019       2020
1  2012        Illinois  ...       2019       2020
2  2012  North Carolina  ...       2019       2020
3  2012        Virginia  ...       2019       2020
4  2013         Indiana  ...       2020       2021

[5 rows x 11 columns]

In [74]:
#Creating the list of values for additions in year N

coal_add = []
for index, row in coal_jobs_nameplate_demo.iterrows():

  found_match = False
  for index2, row2 in coal_historic_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['STATE']):
          found_match = True
          coal_add.append(row2["NAMEPLATE CAPACITY (MW)"])

  if not found_match:
     coal_add.append(0)

In [75]:
#Adding a new colummn "HISTORIC ADDITIONS N" with the list above to the big coal DF

coal_jobs_nameplate_demo['HISTORIC ADDITIONS N'] = coal_add

##5.4 Coal projected additions

In [76]:
file_id_coal = '1XUckkvLm9lEqqOdgc04-hooN_W9oMra6'
additions= drive.CreateFile({'id': file_id_coal})
additions.GetContentFile('additions.xlsx')
coal_projected_additions = pd.read_excel('additions.xlsx')

coal_projected_additions

   PREDICTION YEAR  Year of Projection  ...  State Nameplate Capacity (MW)
0             2016                2015  ...     PA                     5.1
1             2016                2015  ...     WY                   320.0
2             2016                2015  ...     AK                    17.0
3             2016                2015  ...     WY                   350.0
4             2017                2016  ...     AK                    17.0
5             2017                2016  ...     KY                    90.0
6             2017                2016  ...     WY                   350.0
7             2017                2016  ...     WY                   320.0
8             2019                2018  ...     WY                   320.0
9             2020                2019  ...     AK                    17.0

[10 rows x 5 columns]

In [77]:
coal_projected_additions['State'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [78]:
#Colummn Additions N+1

coal_add_1 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR'] == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_1.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_1.append(0)

In [79]:
#Adding a new colummn "PROJECTED ADD N+1" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED ADD N+1'] = coal_add_1

In [80]:
#Colummn Additions N+2

coal_add_2 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+1 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_2.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_2.append(0)

In [81]:
#Adding a new colummn "PROJECTED ADD N+2" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED ADD N+2'] = coal_add_2

In [82]:
#Colummn Additions N+3

coal_add_3 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+2 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_3.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_3.append(0)

In [83]:
#Adding a new colummn "PROJECTED ADD N+3" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED ADD N+3'] = coal_add_3

In [84]:
#Colummn Additions N+4

coal_add_4 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+3 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_4.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_4.append(0)

In [85]:
#Adding a new colummn "PROJECTED ADD N+4" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED ADD N+4'] = coal_add_4

In [86]:
#Colummn Additions N+5

coal_add_5 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+4 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_5.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_5.append(0)

In [87]:
#Adding a new colummn "PROJECTED ADD N+5" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED ADD N+5'] = coal_add_5

In [88]:
#Colummn Additions N+6

coal_add_6 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+5 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_6.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_6.append(0)

In [89]:
#Adding a new colummn "PROJECTED ADD N+6" with the list above to the big coal DF

coal_jobs_nameplate_demo['PROYECTED ADD N+6'] = coal_add_6

In [90]:
#Colummn Additions N+7

coal_add_7 = []
for index, row in coal_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in coal_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+6 == row2['Projected Retirement Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (coal_add_7.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    coal_add_7.append(0)

In [91]:
# Exporting coal_jobs_nameplate_demo (N, N+1, N+2, ...., N+7)
from google.colab import drive
drive.mount('drive', force_remount=True)

coal_jobs_nameplate_demo.to_excel('/content/drive/My Drive/coal_jobs_nameplate_demo_N+7_add.xlsx', encoding='utf-8', index=False)

Mounted at drive

#6 Coal levelized cost

In [92]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [93]:
#Coal
file_id_coal_LC = '1ipuM3MDPt0u85nyYLC40EL9uUcJj9JgH'
coalLC= drive.CreateFile({'id': file_id_coal_LC})
coalLC.GetContentFile('coalLC.xlsx')
coal_LCOE = pd.read_excel('coalLC.xlsx')

coal_LCOE

   PREDICTION YEAR  LCOE ($/MWh)
0             2012           102
1             2013           105
2             2014           112
3             2015           108
4             2016           102
5             2017           102
6             2018           102
7             2019           109
8             2020           112
9             2021           108

In [94]:
# Adding LCOE to the big coal dataframe 

coal= pd.merge(coal_jobs_nameplate_demo, coal_LCOE, how="outer", on=["PREDICTION YEAR"])

# filling with 0 all  NA/NaN values
coal.fillna(0, inplace=True)

#7 Exporting coal DF

In [ ]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [ ]:
#Importing the big solar dataframe (solar_jobs_nameplate_demo)
file_id = '1-qhPLfQbZMqPpemB3Ik8kBF-WqGoZn_f'
solar_all= drive.CreateFile({'id': file_id})
solar_all.GetContentFile('solar_all.xlsx')
solar_jobs_nameplate_demo = pd.read_excel('solar_all.xlsx')

solar_jobs_nameplate_demo.head(2)

     STATE  ...  EDUCATIONAL ATTAINMENT 25 YEARS OR OLDER (BACHELOR DEGREE)
0  Alabama  ...                                                  0
1   Alaska  ...                                                  0

[2 rows x 12 columns]

#8 Solar retirements and additions

##8.1 Historic additions solar

In [96]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [97]:
# Historic additions solar for colummn N
file_id_add = '1pxeSIMDwC3tV3YPbv5z4NQM4WZU-DBeu'
solarhistoric_add= drive.CreateFile({'id': file_id_add})
solarhistoric_add.GetContentFile('solarhistoric_add.xlsx')
solar_historic_additions = pd.read_excel('solarhistoric_add.xlsx')

# replacen acronyms by state names
solar_historic_additions['STATE'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [98]:
solar_historic_additions.head()

   YEAR        STATE  NAMEPLATE CAPACITY  ...  PREDIC N+5  PREDIC N+6  PREDIC N+7
0  2012      Arizona               485.9  ...        2018        2019        2020
1  2012   California               450.7  ...        2018        2019        2020
2  2012     Colorado                32.8  ...        2018        2019        2020
3  2012  Connecticut                 0.8  ...        2018        2019        2020
4  2012     Delaware                11.8  ...        2018        2019        2020

[5 rows x 11 columns]

In [99]:
#Creating the list of values for additions in year N

solar_add = []
for index, row in solar_jobs_nameplate_demo.iterrows():

  found_match = False
  for index2, row2 in solar_historic_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['STATE']):
          found_match = True
          solar_add.append(row2["NAMEPLATE CAPACITY"])

  if not found_match:
     solar_add.append(0)

In [100]:
#Adding a new colummn "HISTORIC ADDITIONS N" with the list above to the big solar DF

solar_jobs_nameplate_demo['HISTORIC ADDITIONS N'] = solar_add

##8.2 Projected additions solar

In [101]:
file_id_solar = '13C5R5sIMUC9VpOXdvOK7nJb10QdY8bG_'
additions= drive.CreateFile({'id': file_id_solar})
additions.GetContentFile('additions.xlsx')
solar_projected_additions = pd.read_excel('additions.xlsx')

solar_projected_additions

     PREDICTION YEAR  Year of Projection  ...  State Nameplate Capacity (MW)
0               2015                2014  ...     AZ                    51.0
1               2015                2014  ...     CA                  2015.8
2               2015                2014  ...     HI                    37.0
3               2015                2014  ...     IN                     5.3
4               2015                2014  ...     NC                   364.2
..               ...                 ...  ...    ...                     ...
384             2022                2021  ...     AZ                   200.0
385             2022                2021  ...     NC                    61.0
386             2022                2021  ...     OR                   250.0
387             2022                2021  ...     UT                   324.0
388             2022                2021  ...     SC                  1052.8

[389 rows x 5 columns]

In [102]:
solar_projected_additions['State'].replace({'AZ':'Arizona', 'CA':'California', 'CO':'Colorado', 'DE':'Delaware', 'FL':'Florida', 'GA':'Georgia', 'HI':'Hawaii', 
        'IL':'Illinois', 'IN':'Indiana', 'MA':'Massachusetts', 'MD':'Maryland',
       'NC':'North Carolina', 'NJ':'New Jersey', 'NM':'New Mexico', 'NV':'Nevada', 'NY':'New York', 'OH':'Ohio',
        'OR': 'Oregon' , 'PA':'Pennsylvania', 'TN':'Tennessee', 'TX':'Texas',
       'UT':'Utah', 'VT':'Vermont', 'WA':'Washington', 'CT': 'Connecticut', 'MN':'Minnesota',
        'RI':'Rhode Island', 'SC': 'South Carolina', 'MO':'Missouri', 'WI':'Wisconsin', 'AR':'Arkansas', 'KS':'Kansas',
       'MI':'Michigan', 'OK':'Oklahoma', 'AL':'Alabama', 'IA':'Iowa', 'ID':'Idaho', 'KY':'Kentucky', 'MS':'Mississippi',
        'NE':'Nebraska', 'SD':'South Dakota', 'ND':'North Dakota', 'AK':'Alaska', 'WV':'West Virginia',
        'VA':'Virginia', 'LA':'Louisiana','ME':'Maine', 'MT':'Montana', 'WY':'Wyoming', 'DC':'District of Columbia', 'NH':'New Hampshire'}, inplace=True)

In [103]:
#Colummn Additions N+1

solar_add_1 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR'] == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_1.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_1.append(0)

In [104]:
#Adding a new colummn "PROJECTED ADD N+1" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+1'] = solar_add_1

In [105]:
#Colummn Additions N+2

solar_add_2 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+1 == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_2.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_2.append(0)

In [106]:
#Adding a new colummn "PROJECTED ADD N+2" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+2'] = solar_add_2

In [107]:
#Colummn Additions N+3

solar_add_3 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+2 == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_3.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_3.append(0)

In [108]:
#Adding a new colummn "PROJECTED ADD N+3" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+3'] = solar_add_3

In [109]:
#Colummn Additions N+4

solar_add_4 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+3 == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_4.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_4.append(0)

In [110]:
#Adding a new colummn "PROJECTED ADD N+4" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+4'] = solar_add_4

In [111]:
#Colummn Additions N+5

solar_add_5 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+4 == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_5.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_5.append(0)

In [112]:
#Adding a new colummn "PROJECTED ADD N+5" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+5'] = solar_add_5

In [113]:
#Colummn Additions N+6

solar_add_6 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+5 == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_6.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_6.append(0)

In [114]:
#Adding a new colummn "PROJECTED ADD N+6" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+6'] = solar_add_6

In [115]:
#Colummn Additions N+7

solar_add_7 = []
for index, row in solar_jobs_nameplate_demo.iterrows():
  found_match = False
  for index2, row2 in solar_projected_additions.iterrows():

    if (row['PREDICTION YEAR']== row2['PREDICTION YEAR']) & (row['STATE']== row2['State']) & (row['PREDICTION YEAR']+6 == row2['Projected Additions Year']):
          if found_match == True:
              print("{} ; {}".format(row2['PREDICTION YEAR'], row2['State']))
          found_match = True
          (solar_add_7.append(row2["Nameplate Capacity (MW)"]))
          
          

  if found_match == False:
    solar_add_7.append(0)

In [116]:
#Adding a new colummn "PROJECTED ADD N+7" with the list above to the big solar DF

solar_jobs_nameplate_demo['PROYECTED ADD N+7'] = solar_add_7

#9 Solar levelized cost

In [117]:
auth.authenticate_user()
gauth = GoogleAuth()
gauth.credentials = GoogleCredentials.get_application_default()
drive = GoogleDrive(gauth)

In [118]:
#Solar
file_id_solar_LC = '1ZPnF6uXE1zVOr8-Cl2ED5PTsXuj1nOHX'
solarLC= drive.CreateFile({'id': file_id_solar_LC})
solarLC.GetContentFile('solarLC.xlsx')
solar_LCOE = pd.read_excel('solarLC.xlsx')

solar_LCOE

   PREDICTION YEAR  LCOE ($/MWh)
0             2012           125
1             2013           104
2             2014            79
3             2015            64
4             2016            55
5             2017            50
6             2018            43
7             2019            41
8             2020            37
9             2021            36

In [119]:
# Adding LCOE to the big solar dataframe 

solar= pd.merge(solar_jobs_nameplate_demo, solar_LCOE, how="outer", on=["PREDICTION YEAR"])

# filling with 0 all  NA/NaN values
solar.fillna(0, inplace=True)

#9 Exporting the solar DF

In [ ]:
# Exporting Solar
from google.colab import drive
drive.mount('drive', force_remount=True)

solar.to_excel('/content/drive/My Drive/DF Solar Final.xlsx', encoding='utf-8', index=False)

Mounted at drive